In [ ]:
import pandas as pd
from pathlib import Path
import pickle

In [ ]:
upstream = None
product = None

# Lectura de datos

In [3]:
df = pd.read_csv("storage/01_titanic_dataset.csv")
df.head(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True

## Limpieza de datos

In [4]:
# Eliminar filas con valores faltantes
df.dropna(inplace=True)

# Eliminar columnas que no ser√°n utilizadas en el modelo
df.drop(["deck", "embark_town", "alive", "class", "who"], axis=1, inplace=True)

In [ ]:
Path(product['df']).parent.mkdir(exist_ok=True, parents=True)
Path(product['df']).write_bytes(pickle.dumps(df))